import React, { useEffect } from 'react';
import style from './oferta.module.css'

export default function Oferta() {

  useEffect(() => {
    window.scrollTo(0, 0);
  }, [])


  return (
    <div className={style.wrapper}>
      <div className={style.container}>
        <p>ПУБЛИЧНАЯ ОФЕРТА О ПРЕДОСТАВЛЕНИИ УСЛУГ. ОСНОВНЫЕ ПОНЯТИЯ</p>
        <hr />
        Пользователь – физическое лицо, посетитель Сайта, принимающий условия настоящего Соглашения. <br />
        Покупатель – Пользователь, совершивший заказ товара на сайте http://www.beri.ru<br />
        Продавец – Гражданка РФ Магомадова З.З. <br />
        Интернет-магазин – Интернет-сайт, принадлежащий Продавцу, расположенный в сети интернет по адресу http://www.beri.ru, где представлены Товары, предлагаемые Продавцом для приобретения, а также условия оплаты и доставки Товаров Покупателям.
        Сайт – http://www.beri.ru <br />
        Товар – обувь, одежда, аксессуары и иные товары, представленные к продаже на Сайте Продавца.<br />
        Заказ – должным образом оформленный запрос Покупателя на приобретение и доставку по указанному Покупателем адресу / посредством самовывоза Товаров, выбранных на Сайте.<br />

        <b>1. ОБЩИЕ ПОЛОЖЕНИЯ</b><br />
        1.1. Продавец осуществляет продажу Товаров через Интернет-магазин по адресу http://www.beri.ru <br />
        1.2. Заказывая Товары через Интернет-магазин, Пользователь соглашается с условиями продажи Товаров, изложенными ниже (далее – Доставка и Оплата). В случае несогласия с настоящим Пользовательским соглашением (далее - Соглашение) Пользователь обязан немедленно прекратить использование сервиса и покинуть сайт http://www.beri.ru<br />
        1.3. Настоящие Условия продажи товаров, а также информация о Товаре, представленная на Сайте, являются публичной офертой в соответствии со ст.435 и п.2 ст.437 Гражданского кодекса Российской Федерации.<br />
        1.4. Пользователь соглашается с Условиями продажи товаров путем Подтверждения Заказа, при оформлении Заказа.<br />
        1.5. Соглашение может быть изменено Продавцом в одностороннем порядке без уведомления Пользователя/Покупателя. Новая редакция Соглашения вступает в силу по истечении 10 (Десяти) календарных дней с момента ее опубликования на Сайте, если иное не предусмотрено условиями настоящего Соглашения.<br />
        1.6. Соглашение вступает в силу с момента отправки Покупателю Продавцом электронного подтверждения принятия Заказа при оформлении Покупателем Заказа на Сайте.<br />
        Сообщая Продавцу свой e-mail, Пользователь/Покупатель дает согласие на использование его в целях осуществления рассылок рекламно-информационного характера, содержащих информацию о скидках, предстоящих и действующих акциях и иных мероприятиях Продавца.<br />

        <b>2. ПРЕДМЕТ СОГЛАШЕНИЯ</b><br />
        2.1. Предметом настоящего Соглашения является предоставление возможности Пользователю приобретать для личных, семейных, домашних и иных нужд, не связанных с осуществлением предпринимательской деятельности, Товары, представленные в каталоге Интернет-магазина по адресу http://www.beri.ru<br />

        <b>3. РЕГИСТРАЦИЯ НА САЙТЕ</b><br />
        3.1. Регистрация на Сайте осуществляется по адресу http://www.beri.ru/user/register<br />
        3.2. Регистрация на Сайте не является обязательной для оформления Заказа.<br />
        3.3. Продавец не несет ответственности за точность и правильность информации, предоставляемой Пользователем при регистрации.<br />
        3.4. Пользователь обязуется не сообщать третьим лицам логин и пароль, указанные Пользователем при регистрации.<br />
        3.5. Общение Пользователя/Покупателя с операторами Call-центра / менеджерами и иными представителями Продавца должно строиться на принципах общепринятой морали и коммуникационного этикета. Строго запрещено использование нецензурных слов, брани, оскорбительных выражений, а также угроз и шантажа, в независимости от того, в каком виде и кому они были адресованы.<br />

        <b>4. ТОВАР И ПОРЯДОК СОВЕРШЕНИЯ ПОКУПКИ</b><br />
        4.1. Продавец обеспечивает наличие на своем складе Товаров, представленных на Сайте. Сопровождающие Товар фотографии являются простыми иллюстрациями к нему и могут отличаться от фактического внешнего вида Товара. Сопровождающие Товар описания/характеристики не претендуют на исчерпывающую информативность и могут содержать опечатки.<br />
        4.2. В случае отсутствия заказанных Покупателем Товаров на складе Продавца, последний вправе исключить указанный Товар из Заказа / аннулировать Заказ Покупателя, уведомив об этом Покупателя путем написания комментария к заказу или направления соответствующего электронного сообщения по адресу, указанному Покупателем при регистрации или звонком оператора Call-центра Продавца.<br />
        4.3. В случае аннуляции полностью либо частично предоплаченного Заказа стоимость аннулированного Товара возвращается Продавцом Покупателю способом, которым Товар был оплачен.<br />
        4.4. Заказ Покупателя оформляется в соответствии с процедурами, указанными на Сайте при Оформлении Заказа<br />
        4.5. Покупатель несет полную ответственность за предоставление неверных сведений, повлекшее за собой невозможность надлежащего исполнения Продавцом своих обязательств перед Покупателем.<br />
        4.6. После оформления Заказа на Сайте Покупателю предоставляется информация о предполагаемой дате доставки путем направления электронного сообщения по адресу, указанному Покупателем при регистрации, или по телефону. Менеджер, обслуживающий данный Заказ, уточняет детали Заказа, согласовывает дату доставки, которая зависит от наличия заказанных Товаров на складе Продавца и времени, необходимого для обработки, сборки и доставки Заказа.<br />
        4.7. Ожидаемая дата передачи Заказа в Службу доставки сообщается Покупателю менеджером, обслуживающим Заказ, по электронной почте или при контрольном звонке Покупателю.<br />

        <b>5. ДОСТАВКА ЗАКАЗА</b><br />
        5.1. Способы, а также примерные сроки доставки Товаров указаны на Сайте в разделе «Доставка и Оплата» по адресу http://www.beri.ru/dostavka. Конкретные сроки доставки могут быть согласованы Покупателем с оператором Call-центра при подтверждении заказа.
        5.2. Территория доставки Товаров, представленных на Сайте, ограничена пределами Российской Федерации.<br />
        5.3. Задержки в доставке возможны ввиду непредвиденных обстоятельств, произошедших не по вине Продавца.<br />
        5.4. При доставке Заказ вручается Покупателю либо третьему лицу, указанному в Заказе в качестве получателя (далее Покупатель и третье лицо именуются «Получатель»). При невозможности получения Заказа, оплаченного посредством наличного расчета, указанными выше лицами, Заказ может быть вручен лицу, который может предоставить сведения о Заказе (номер отправления и/или ФИО Получателя), а также оплатить стоимость Заказа в полном объеме лицу, осуществляющему доставку Заказа.<br />
        5.5. Во избежание случаев мошенничества, а также для выполнения взятых на себя обязательств, указанных в пункте 5. настоящего Соглашения, при вручении предоплаченного Заказа лицо, осуществляющее доставку Заказа, вправе затребовать документ, удостоверяющий личность Получателя, а также указать тип и номер предоставленного Получателем документа на квитанции к Заказу. Продавец гарантирует конфиденциальность и защиту персональных данных Получателя (п.9.3.).<br />
        5.6. Риск случайной гибели или случайного повреждения Товара переходит к Покупателю с момента передачи ему Заказа и проставления Получателем Заказа подписи в документах, подтверждающих доставку Заказа. В случае недоставки Заказа Продавец возмещает Покупателю стоимость предоплаченного Покупателем Заказа и доставки в полном объеме после получения от Службы доставки подтверждения утраты Заказа.<br />
        5.7. Стоимость доставки каждого Заказа рассчитывается индивидуально, исходя из веса Товара, региона и способа доставки, а также (в случае необходимости) формы оплаты, и указывается на Сайте на последнем этапе оформления Заказа.
        5.8. Обязанность Продавца передать товар Покупателю считается исполненной в момент вручения курьером/траноспортной компанией Товара Получателю<br />
        В случае наличия претензий к доставленному Товару (недовложение, вложение Товара отличного от указанного в Заказе, производственный брак, иные претензии) следует связаться с менеджерами интернет магазина по e-mail или по телефону, указанным в разделе "Контакты". Если Получателем не были заявлены претензии, то Продавец считается полностью и надлежащим образом исполнившим свою обязанность по передаче Товара.<br />
        В случае возврата Товара в связи с наличием претензий к Товару Получатель обязан приложить к Отправлению (возврат/обмен), содержащему возвращаемый Товар, следующие документы:<br />
        заявление на возврат/обмен (шаблоны заявлений находятся по адресу http://www.beri.ru/dostavka);<br />
        5.9. При принятии Заказа от курьера, Получатель обязан осмотреть доставленный Товар и проверить его на соответствие заявленному количеству, ассортименту и комплектности Товара, а также проверить целостность упаковки. В случае отсутствия претензий к доставленному Товару Получатель расписывается в накладной/товарном чеке и оплачивает Заказ (в отсутствие 100%-ной предоплаты). Подпись в доставочных документах свидетельствует о том, что претензий к Товару Получателем не заявлено и Продавец полностью и надлежащим образом выполнил свою обязанность по передаче Товара.<br />
        5.10. Время нахождения курьера по адресу Получателя ограничено 15 минутами.<br />
        5.11. Уточнить дату, время можно у менеджера/оператора, который связывается с Покупателем для подтверждения Заказа.<br />
        5.12. Пользователь понимает и соглашается с тем, что:<br />
        осуществление доставки - отдельная услуга, не являющаяся неотъемлемой частью приобретаемого Покупателем Товара, выполнение которой заканчивается в момент получения Получателем Товара и осуществления платежа за него. Претензии к качеству приобретенного Товара, возникшие после получения и оплаты Товара, рассматриваются в соответствии с Законом РФ «О защите прав потребителей» и гарантийными обязательствами Продавца. В связи с этим приобретение Товара с доставкой не дает Покупателю право требования доставки приобретенного Товара в целях гарантийного обслуживания или замены, не дает возможности осуществлять гарантийное обслуживание или замену Товара посредством выезда к Покупателю и не подразумевает возможность возврата стоимости доставки Товара в случаях, когда Покупатель имеет право на возврат денег за Товар как таковой, в соответствии с Законом РФ «О защите прав потребителей».<br />

        <b>6. ОПЛАТА ТОВАРА</b><br />
        6.1. Цена товара указывается в рублях Российской Федерации и включает в себя налог на добавленную стоимость.<br />
        6.2. Цена Товара указывается на Сайте. В случае неверного указания цены заказанного Покупателем Товара, Продавец информирует об этом Покупателя при подтверждении Заказа по исправленной цене либо аннулирования Заказа. При невозможности связаться с Покупателем данный Заказ считается аннулированным. Если Заказ был оплачен, Продавец возвращает Покупателю оплаченную за Заказ сумму тем же способом, которым она была уплачена.<br />
        6.3. Цена Товара на Сайте может быть изменена Продавцом в одностороннем порядке. При этом цена на заказанный Покупателем Товар изменению не подлежит.<br />
        6.4. Особенности оплаты Товара с помощью банковских карт:<br />
        6.4.1 В соответствии с положением ЦБ РФ «Об эмиссии банковских карт и об операциях, совершаемых с использованием платежных карт» от 24.12.2004 №266-П операции по банковским картам совершаются держателем карты либо уполномоченным им лицом.<br />
        6.4.2 Авторизация операций по банковским картам осуществляется банком. Если у банка есть основания полагать, что операция носит мошеннический характер, то банк вправе отказать в осуществлении данной операции. Мошеннические операции с банковскими картами попадают под действие статьи 159 УК РФ.<br />
        6.4.3 Во избежание случаев различного рода неправомерного использования банковских карт при оплате все Заказы, оформленные на Сайте и предоплаченные банковской картой, проверяются Продавцом. Согласно Правилам международных платежных систем в целях проверки личности владельца и его правомочности на использование карты Покупатель, оформивший такой заказ, обязан по запросу, поступившему от Продавца, предоставить копию двух страниц паспорта владельца банковской карты - разворота с фотографией, а также копию банковской карты с обеих сторон (номер карты нужно закрыть, кроме последних четырех цифр). Продавец оставляет за собой право без объяснения причины аннулировать Заказ, в том числе в случае непредставления указанных документов Покупателем (по электронной почте в виде сканированных копий) в течение 14 (Четырнадцати) календарных дней с даты оформления Заказа или наличия сомнений в их подлинности. Стоимость Заказа возвращается на карту владельца.<br />
        6.5. Продавец вправе предоставлять скидки на Товары и устанавливать дисконтную систему. Виды скидок, бонусов, порядок и условия начисления указаны на Сайте и могут быть изменены Продавцом в одностороннем порядке.<br />

        <b>7. ВОЗВРАТ ТОВАРА И ДЕНЕЖНЫХ СРЕДСТВ</b><br />
        7.1. Возврат Товара осуществляется в соответствии с «Условиями возврата», указанными на Сайте по адресу http://www.beri.ru/dostavka в разделе «Порядок возврата и обмена товара".<br />

        7.2. Возврат и обмен товара надлежащего качества.<br /><br />
        7.2.1. Вы можете отказаться от заказанного товара в любое время ДО его получения. Если товар не подошел Вам по какой-либо причине, Вы вправе вернуть или обменять его на аналогичный товар в течение 14 (четырнадцати) календарных дней с момента продажи товара. Возврат товара надлежащего качества возможен в случае, если сохранены его товарный вид, потребительские свойства, а также документ, подтверждающий покупку указанного товара (кассовый и товарный чеки, накладная).При себе иметь паспорт!.<br />
        7.2.2. Вы не можете отказаться от товара надлежащего качества, имеющего индивидуально-определенные свойства (белье, чулочно-носочные изделия), или товаров указанных в Перечне непродовольственных товаров надлежащего качества, не подлежащих возврату или обмену, утвержденном Постановлением Правительства РФ от 19.01.1998 № 55.<br />
        7.2.3. Стоимость доставки возврату не подлежит. Расходы по доставке и возврату товара несет Покупатель.<br /><br />
        В случае отказа от совершенного заказа после его отправки по причинам, не связанным с качеством товаров, доставка оплачивается покупателем.<br /><br />
        Возврат товара Вы можете произвести по адресу: г.Грозный, ул.Маяковского, 13, ТЦ HOMERRY, 4-й этаж, шоурум №2.<br /><br />

        7.3. Возврат Товара ненадлежащего качества:<br /><br />
        7.3.1. Под товаром ненадлежащего качества подразумевается товар, который неисправен и не может обеспечить исполнение своих функциональных качеств. Полученный Товар должен соответствовать описанию на Сайте. Отличие элементов дизайна, или оформления от заявленных в описании на Сайте не является признаком некачественности или нефункциональности Товара.<br />
        7.3.2. Внешний вид и комплектность Товара, а также комплектность всего Заказа должны быть проверены Получателем в момент доставки Товара.<br />
        7.3.3. При доставке Товара Покупатель ставит свою подпись в квитанции о доставке в графе: «Заказ принял, что означает- комплектность полная, претензий к количеству и внешнему виду товара не имею». После получения Заказа претензии к внешним дефектам товара, его количеству, комплектности и товарному виду не принимаются.<br />
        7.3.4. Если Покупателю был передан Товар ненадлежащего качества и оное не было заранее оговорено Продавцом, Покупатель вправе воспользоваться положениями ст. 18 «Права потребителя при обнаружении в товаре недостатков» Закона о защите прав потребителей.<br />
        7.3.5. Срок возврата денежных средств определяется в соответствии со способом возврата и составляет не более 10 дней c даты поступления возвращенного товара на склад Продавца вместе с заполненным Покупателем заявлением на возврат.<br />
        7.4. Если оплата была произведена путем банковского перевода, то возврат денежных средств осуществляется только лицу, оплатившему заказ. При этом, в заявлении на возврат денежных средств необходимо указать реквизиты для перечисления. Заявления на возврат Товара можно найти по адресу http://www.beri.ru/dostavka в разределе «шаблоны заявлений на возврат"<br />

        <b>8. ОТВЕТСТВЕННОСТЬ</b><br />
        8.1. Продавец не несет ответственности за ущерб, причиненный Покупателю вследствие ненадлежащего использования Товаров, приобретенных в Интернет-магазине.<br />
<br />
        <b>9. КОНФИДЕНЦИАЛЬНОСТЬ И ЗАЩИТА ИНФОРМАЦИИ</b><br />
        9.1. Персональные данные Пользователя/Покупателя обрабатывается в соответствии с ФЗ «О персональных данных» №152-ФЗ и Политикой конфиденциальности Продавца.<br />
        9.2. При регистрации на Сайте Пользователь предоставляет следующую информацию: Фамилия, Имя, адрес электронной почты, пароль для доступа к Сайту.<br />
        9.3. Предоставляя свои персональные данные при регистрации на Сайте, Пользователь соглашается на их обработку Продавцом, в том числе и в целях продвижения Продавцом товаров и услуг.<br />
        9.4. Продавец использует персональные данные Пользователя/Покупателя:<br />
        для регистрации Пользователя на Сайте;<br />
        для выполнения своих обязательств перед Пользователем/Покупателем;<br />
        для оценки и анализа работы Сайта;<br />
        для определения победителя в акциях, проводимых Продавцом.<br />
        9.4.1. Продавец имеет право отправлять информационные, в том числе рекламные сообщения, на электронную почту и мобильный телефон Пользователя/Покупателя с его согласия. Сервисные сообщения, информирующие Пользователя/Покупателя о заказе и этапах его обработки, отправляются автоматически и не могут быть отклонены Пользователем/Покупателем.<br />
        9.6. Продавец получает информацию об ip-адресе посетителя Сайта http://www.beri.ru. Данная информация не используется для установления личности посетителя.<br />
        9.7. Продавец не несет ответственности за сведения, предоставленные Пользователем/Покупателем на Сайте в общедоступной форме.<br />

        <b>10.ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</b><br />
        10.1. Интернет-магазин и предоставляемые сервисы могут временно частично или полностью недоступны по причине проведения профилактических или иных работ или по любым другим причинам технического характера. Техническая служба Продавца имеет право периодически проводить необходимые профилактические или иные работы с предварительным уведомлением Покупателей или без такового.<br />
        10.2.К отношениям между Пользователем/Покупателем и Продавцом применяются положения Российского законодательства<br />
        10.3.В случае возникновения вопросов и претензий со стороны Пользователя/Покупателя он должен обратиться к Продавцу по телефону или иным доступным способом. Все возникающее споры стороны будут стараться решить путем переговоров, при недостижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством РФ.<br />
        Признание судом недействительности какого-либо положения настоящего Соглашения не влечет за собой недействительность остальных положений.<br />
      </div>
    </div>
  )
}
