import React, { useEffect } from 'react';
import style from './privacyPolicy.module.css'

export default function PrivacyPolicy() {

  useEffect(() => {
    window.scrollTo(0, 0);
  }, [])


  return (
    <div className={style.wrapper}>
      <div className={style.container}>
        <p>
          ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
        </p>
        <hr />
        
        Настоящая Политика конфиденциальности (далее – Политика конфиденциальности) действует в отношении всех материалов и сервисов интернет-магазина «BERi» на домене www.beri.ru (далее Интернет-магазин), и данных, которые можно получить о Пользователе во время использования сайта Интернет-магазина. <br />

        <b>1. Понятия, используемые в настоящей Политике конфиденциальности.</b><br />

        Администрация сайта Интернет-магазина (далее – Администрация сайта) – уполномоченные сотрудники, действующие от имени Интернет-магазина «BERi», которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.<br />

        Персональные данные - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).<br />

        Обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.<br />

        Пользователь сайта Интернет-магазина (далее Пользователь) – любой посетитель, находящийся и заходивший на Сайт, а также разместивший Заказ в Интернет-магазине www.beri.ru<br />

        <b>2. Общие положения.</b><br />

        Использование Пользователем сайта Интернет-магазина означает согласие с настоящей Политикой конфиденциальности, условиями обработки персональных данных Пользователя и Публичной офертой.<br />

        В случае несогласия с условиями Политики конфиденциальности Пользователь должен покинуть сайт Интернет-магазина.<br />

        Настоящая Политика конфиденциальности применяется только к сайту Интернет-магазина BERi. Интернет-магазин не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте Интернет-магазина.<br />

        Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта Интернет-магазина. Однако Администрация сайта и Пользователь исходят из того, что Пользователь предоставляет достоверную и достаточную персональную информацию и поддерживает эту информацию в актуальном состоянии.<br />

        Пользователь обязан соблюдать положения действующего законодательства Российской Федерации и настоящего документа, возмещать убытки, понесенные ФЛ Магомадова З.З., другими Пользователями или третьими лицами в результате нарушения Политики конфиденциальности или законодательства Российской Федерации.<br />

        <b>3. Цели сбора персональной информации пользователя.</b><br />

        При регистрации и оформлении заказа на Сайте, а также, подписке на рассылку, Пользователь предоставляет свои персональные данные интернет-магазину «BERi », соглашаясь на сбор, обработку, хранение, уточнение (обновление, изменение), обезличивание, удаление и уничтожение, в том числе автоматизированные, а также на использование их в целях:<br />

        - регистрации и авторизации на сайте,<br />

        - предоставления Пользователю доступа к персонализированным ресурсам Сайта интернет-магазина,<br />

        - установления с Пользователем обратной связи, включая отправку уведомлений, запросов, касающихся использования Сайта интернет-магазина, оказания услуг, обработка запросов и заявок от Пользователя, обработка Заказов Пользователя и для выполнения обязательств перед Пользователем,<br />

        - создания учетной записи для совершения покупок, если Пользователь оформляет заказ по телефону или через иные способы оформления заказа,<br />

        - уведомления Пользователя Сайта интернет-магазина о состоянии Заказа, обработки и получения платежей, оспаривания платежа,<br />

        - предоставления Пользователю эффективной клиентской и технической поддержки,<br />

        - определения победителя в акциях, проводимых на Сайте,<br />

        - информирования Пользователя об акциях, скидках и специальных предложениях посредством электронных и СМС-рассылок.<br />

        Интернет-магазин осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.<br />

        Отключение cookies может повлечь невозможность доступа к частям сайта Интернет-магазина, требующим авторизации.<br />

        <b>4. Способы и сроки обработки персональных данных.</b><br />

        Персональные данные Пользователя обрабатываются в соответствии с ФЗ «О персональных данных» № 152-ФЗ.<br />

        Согласие на обработку персональных данных действует вплоть до отзыва пользователем, который осуществляется по заявке по адресу info@beri.ru.<br />

        В отношении указанных данных сохраняется их конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц.<br />

        При использовании отдельных сервисов Сайта, пользователь соглашается с тем, что определённая часть его персональной информации становится общедоступной.<br />

        Передача администрацией Сайта персональных данных пользователя третьим лицам возможна либо по согласию самого пользователя, либо по требованию компетентных органов в соответствии с действующим законодательством.<br />

        Не считается нарушением предоставление информации агентам и третьим лицам, действующим на основании договора с ФЛ Магомадова З.З., для исполнения обязательств перед пользователем и только в рамках договоров.<br />

        Не считается нарушением настоящего пункта передача администрацией Сайта третьим лицам данных о Пользователе в обезличенной форме в целях оценки и анализа работы Сайта, анализа покупательских особенностей Пользователя и предоставления персональных рекомендаций.<br />

        <b>5. Дополнительные условия.</b><br />

        ФЛ Магомадова З.З. оставляет за собой право изменять и дополнять настоящую Политику конфиденциальности. Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте Интернет-магазина «BERi».<br />

        Ничто в данной Политике конфиденциальности не может пониматься как установление между Пользователем и Администрации Сайта каких-либо иных отношений, прямо не предусмотренных Политикой конфиденциальности.<br />

        Все предложения или вопросы по поводу настоящей Политики конфиденциальности Пользователь вправе направлять сотрудникам Интернет-магазина по телефону и электронному адресу, указанным в разделе "Контакты".<br />

        Пользователь подтверждает, что ознакомлен со всеми пунктами настоящей Политики конфиденциальности и безусловно принимает их.<br />

      </div>
    </div>
  )
}
